Tekla Open API Reference for Tekla Structures 2025
ParametricObject_ObjectBoundingBox Properties
The ParametricObject_ObjectBoundingBox type exposes the following members.
Properties
Name | Description
Description
 The description of the product.
 (Inherited from ReferenceModelObjectAttribute.)
Extrusion
 The extrusion vector.
 (Inherited from ReferenceModelObjectAttribute.)
Name
 The name of the product.
 (Inherited from ReferenceModelObjectAttribute.)
ObjectType
 The object type of the product.
 (Inherited from ReferenceModelObjectAttribute.)
Origin
 The origin of the extrusion.
 (Inherited from ReferenceModelObjectAttribute.)
ProfileName
 The name of the profile (often empty).
 (Inherited from ReferenceModelObjectAttribute.)
xDir
 The X-axis direction.
 (Inherited from ReferenceModelObjectAttribute.)
yDir
 The Y direction.
Top
See Also
Reference
ParametricObject_ObjectBoundingBox Class
Tekla.Structures.Model.Collaboration Namespace